#### Terraform Path: `infra/network`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ory-dev/network/runs/run-pmDujFK7MzrkCe8h

Waiting for the plan to start...

Terraform v1.4.1
on linux_amd64
Initializing plugins and modules...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0899371a5b4bbd7b6]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-013efaf6c02250c5f]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-049b5f35bd9ef63ed]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-01f7eacfacd5b9802]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0847521361ffac87f]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-02818b163ee6a745c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0346986aa2999d62f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0fe240852949cadcd]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-011ba4a5425c32b39]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a852f133a4985746]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-086b1f006c4f0e566]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0332db20825e923d3]
module.vpc.aws_egress_only_internet_gateway.this[0]: Refreshing state... [id=eigw-0a162d083f81a6d3a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c90c5ed594296e9c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-035363ab36ac7bbc5]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-01c2226b830391d95]
module.vpc.aws_route.public_internet_gateway_ipv6[0]: Refreshing state... [id=r-rtb-0346986aa2999d62f2750132062]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0346986aa2999d62f1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06f45b4b52ed9dab3]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-03ce8ad93d4830135]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e957212ccdfef75f]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ory-dev-database-subnet-group]
module.vpc.aws_route.private_ipv6_egress[1]: Refreshing state... [id=r-rtb-035363ab36ac7bbc52750132062]
module.vpc.aws_route.private_ipv6_egress[0]: Refreshing state... [id=r-rtb-0c90c5ed594296e9c2750132062]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-04a09becf7bdfc87b]
module.vpc.aws_route.private_ipv6_egress[2]: Refreshing state... [id=r-rtb-01c2226b830391d952750132062]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-05d956371632ba7bc]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0566187bfa773cf9b]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0658ab0f136d8801a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09b70adb4148d7f4c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-023ab140088eed64d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.network_info will be created
  + resource "aws_ssm_parameter" "network_info" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Network information for ory dev environment"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ory/dev/network/info"
      + tags_all       = {
          + "Environment"  = "dev"
          + "ManagedBy"    = "Terraform Cloud"
          + "Organization" = "ory-dev"
          + "Project"      = "ory"
          + "Repository"   = "keenan-v1/ory-example"
          + "Workspace"    = "network"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @keenan-v1, Action: `pull_request`*